{
  "version": "1.0",
  "created_at": "2025-11-19T14:38:38.497076",
  "courses": [
    {
      "id": 1,
      "code": "SMM",
      "name": "Social Media Marketing per aziende e professionisti",
      "description": "descrizione corso",
      "total_hours": 40,
      "theory_hours": 40,
      "practice_hours": 40,
      "num_lessons": 12,
      "created_at": "2025-11-17T15:25:01.444867",
      "export_count": 0,
      "lessons": [
        {
          "id": 1,
          "title": "Fondamenti di marketing digitale e social media - Parte Teorica",
          "description": "Cosa sono i Social Media, perché e come sfruttarli al meglio",
          "lesson_type": "theory",
          "duration_hours": 8.0,
          "order": 1,
          "content": "```markdown\n# Fondamenti di Marketing Digitale e Social Media - Parte Teorica\n\n## Introduzione\nIl marketing è un campo dinamico e in continua evoluzione, fortemente influenzato dalle tecnologie digitali. Questa lezione fornirà le basi del marketing digitale e del social media marketing, evidenziando le differenze con il marketing tradizionale e il ruolo cruciale dei social media nel percorso del cliente.\n\n## Contenuti Principali\n\n### 1. Cos’è il Marketing\n\n#### 1.1 Bisogni e Desideri\n- **Bisogni**: Necessità fondamentali per la sopravvivenza e il benessere (es. cibo, abbigliamento, sicurezza).\n- **Desideri**: Forme specifiche assunte dai bisogni, influenzate da cultura e personalità (es. voglia di una pizza gourmet).\n\n#### 1.2 Valore Percepito\n- **Definizione**: La percezione del valore di un prodotto da parte del consumatore, che può differire dal suo valore reale.\n- **Esempio**: Un prodotto di alta moda può avere un valore percepito maggiore rispetto a un prodotto simile ma di un marchio meno noto.\n\n### 2. Marketing Digitale: Panoramica degli Strumenti\n\n#### 2.1 Sito Web\n- Importanza di un sito web responsive e user-friendly.\n- **SEO**: Ottimizzazione dei contenuti per migliorare la visibilità nei motori di ricerca.\n\n#### 2.2 SEO (Search Engine Optimization)\n- Tecniche di SEO on-page e off-page.\n- **Parole chiave**: Ricerca e utilizzo appropriato delle parole chiave.\n\n#### 2.3 Email Marketing\n- Segmentazione del pubblico e personalizzazione delle comunicazioni.\n- Importanza di una call to action chiara.\n\n#### 2.4 Social Media\n- Ruolo dei social media: interazione, coinvolgimento e promozione.\n\n#### 2.5 Adv (Pubblicità Online)\n- Differenze tra PPC (pay-per-click) e display advertising.\n- **Esempio**: Analisi di una campagna Google Ads e i suoi risultati.\n\n### 3. Social Media Marketing: Definizione e Obiettivi\n\n#### 3.1 Definizione\n- Uso strategico dei social media per promuovere il brand e i suoi prodotti o servizi.\n\n#### 3.2 Obiettivi\n- **Brand Visibility**: Aumentare la visibilità del marchio.\n- **Lead Generation**: Tecniche per attrarre potenziali clienti.\n- **Community Building**: Creare una base di clienti fedeli.\n- **Reputation Management**: Monitorare e gestire la reputazione online.\n\n### 4. Panoramica delle Piattaforme\n\n#### 4.1 Facebook\n- Targeting demografico e utilizzo di post, storie e gruppi per l'engagement.\n\n#### 4.2 Instagram\n- Importanza della qualità visiva: immagini e video.\n- Uso di Stories e IGTV per interazioni genuine.\n\n#### 4.3 TikTok\n- Coinvolgimento attraverso contenuti brevi e creativi.\n- Utilizzo di trend e challenge.\n\n#### 4.4 LinkedIn\n- Piattaforma B2B per networking e relazioni professionali.\n\n#### 4.5 YouTube\n- Creazione di video di valore: tutorial e recensioni.\n- Ottimizzazione SEO e titoli accattivanti.\n\n### 5. Algoritmi in Sintesi\n\n#### 5.1 Funzionamento degli Algoritmi\n- Determinano la visibilità dei contenuti attraverso engagement, rilevanza e tempistica.\n\n#### 5.2 Impatto sugli Utenti\n- Strategie per ottimizzare la visibilità: hashtag, orari di pubblicazione e interazione con la community.\n\n### 6. Funnel di Marketing\n\n#### 6.1 Awareness (Consapevolezza)\n- Strategie per far conoscere il marchio: campagne pubblicitarie e contenuti virali.\n\n#### 6.2 Consideration (Considerazione)\n- Tecniche per influenzare le decisioni: testimonianze e recensioni.\n\n#### 6.3 Conversion (Conversione)\n- Fasi che portano all'acquisto: offerte speciali e call to action.\n\n#### 6.4 Loyalty (Fidelizzazione)\n- Strategie per mantenere i clienti: programmi di fidelizzazione e comunicazione continua.\n\n## Esempi Pratici\n- **Caso Studio Facebook Ads**: Analisi di una campagna di successo, evidenziando targeting e risultati.\n- **Analisi di un Post Instagram Efficace**: Studio di un post con alto engagement, focalizzandosi su immagini, didascalie e hashtag.\n- **Simulazione di un Funnel di Marketing**: Creazione di un funnel per un prodotto immaginario, identificando fasi e strategie.\n\n## Riepilogo\nAbbiamo esplorato i fondamenti del marketing digitale e del social media marketing, analizzando le differenze con il marketing tradizionale, il ruolo dei social media nel customer journey e le principali piattaforme e strumenti. Comprendere questi concetti è cruciale per sviluppare strategie efficaci nel mondo del marketing contemporaneo.\n```",
          "objectives": [
            "Comprendere la differenza tra marketing tradizionale e digitale.",
            "Conoscere il ruolo dei social media nel customer journey.",
            "Riconoscere i principali social network e le loro logiche di base."
          ],
          "materials": [
            "\"Principles of Marketing\" di Philip Kotler e Gary Armstrong - Un libro fondamentale per comprendere i concetti base del marketing.",
            "\"Marketing 4.0: Moving from Traditional to Digital\" di Philip Kotler - Esplora la transizione dal marketing tradizionale al digitale.",
            "Hubspot Academy - Corso gratuito di \"Social Media Marketing\" - Piattaforma online che offre corsi gratuiti sui fondamenti del social media marketing.",
            "Video YouTube: \"Digital Marketing Full Course\" di Simplilearn - Un'introduzione completa al marketing digitale e ai social media.",
            "Articolo: \"The Role of Social Media in Customer Engagement\" su Hootsuite Blog - Approfondisce l'importanza dei social media nel coinvolgimento dei clienti.",
            "Google Digital Garage - Corso gratuito di \"Fundamentals of Digital Marketing\" - Offre una panoramica sui principi del marketing digitale."
          ],
          "exercises": [
            "Analizza tre casi studio di aziende che hanno utilizzato i social media per campagne di marketing di successo; identifica le strategie chiave utilizzate e discuti l'impatto sui loro obiettivi di business.",
            "Crea un profilo cliente ideale (buyer persona) per un prodotto o servizio a tua scelta e descrivi quali piattaforme social sarebbero più efficaci per raggiungerlo e perché.",
            "Valuta una campagna di social media marketing recente nel tuo settore di interesse, evidenziando i punti di forza e debolezza, e proponi miglioramenti basati sui concetti appresi in lezione.",
            "Simula la creazione di un piano editoriale per una settimana di contenuti social per un piccolo business locale, includendo obiettivi, tipi di contenuto, e frequenza di pubblicazione.",
            "Rifletti su come i social media possono influenzare il comportamento del consumatore in una determinata fase del percorso del cliente e discuti le potenziali strategie per ciascuna fase."
          ],
          "lesson_date": null,
          "created_at": "2025-11-17T15:25:01.449315",
          "updated_at": "2025-11-18T16:04:28.383374",
          "modification_count": 1
        },
        {
          "id": 2,
          "title": "Fondamenti di marketing digitale e social media - Parte Pratica",
          "description": "Parte pratica del modulo 1",
          "lesson_type": "practice",
          "duration_hours": 4.0,
          "order": 2,
          "content": "- Esercizio guidato: analisi di 2–3 profili social aziendali (punti di forza / debolezza).\n- Mappatura dei social usati dai corsisti: esperienze, percezioni, criticità.\n- Brainstorming collettivo: “Cosa rende un contenuto interessante?”\n\n---\n\n## Contenuto Dettagliato (Generato con ChatGPT)\n\n# Fondamenti di marketing digitale e social media - Parte Pratica\n\n## Introduzione\nQuesta lezione pratica è dedicata all'applicazione dei concetti teorici appresi nel modulo sui fondamenti di marketing digitale e social media. Attraverso esercizi guidati, analisi e brainstorming, i partecipanti avranno l'opportunità di esplorare e comprendere come valutare e migliorare la presenza social delle aziende e dei professionisti.\n\n## Contenuti principali\n\n### 1. Esercizio guidato: Analisi di profili social aziendali\n#### 1.1 Obiettivo\nValutare 2-3 profili social di aziende reali o simulate per identificare punti di forza e debolezza.\n\n#### 1.2 Attività\n- **Selezione dei profili**: I partecipanti scelgono 2-3 profili social aziendali (possono essere aziende locali, nazionali o internazionali) da analizzare.\n- **Analisi SWOT**:\n  - **Punti di forza**: Quali elementi del profilo sono efficaci? (es. coerenza del brand, engagement degli utenti)\n  - **Punti di debolezza**: Quali aspetti potrebbero migliorare? (es. mancanza di contenuti visivi, bassa interazione)\n- **Discussione di gruppo**: Ogni gruppo presenta le proprie analisi e si discute collettivamente le osservazioni.\n\n### 2. Mappatura dei social usati dai corsisti\n#### 2.1 Obiettivo\nComprendere le esperienze e le percezioni dei corsisti riguardo ai social media.\n\n#### 2.2 Attività\n- **Creazione di un questionario**: I corsisti compilano un breve questionario che include domande su:\n  - Quali social media utilizzano (es. Facebook, Instagram, LinkedIn, Twitter)\n  - Frequenza di utilizzo\n  - Tipo di contenuti pubblicati e seguiti\n  - Criticità riscontrate nell'uso dei social media\n- **Discussione di gruppo**: Analizzare i risultati, evidenziando le esperienze comuni e le differenze tra i partecipanti.\n\n### 3. Brainstorming collettivo: “Cosa rende un contenuto interessante?”\n#### 3.1 Obiettivo\nIdentificare gli elementi che rendono un contenuto social attraente e coinvolgente.\n\n#### 3.2 Attività\n- **Discussione aperta**: I partecipanti condividono le proprie idee su:\n  - Tipi di contenuti che trovano interessanti (es. video, infografiche, post interattivi)\n  - Elementi chiave che attirano l'attenzione (es. titoli accattivanti, immagini di alta qualità)\n  - Tecniche di storytelling e coinvolgimento degli utenti\n- **Sintesi delle idee**: Creare una lista di 10-15 caratteristiche comuni ritenute fondamentali per un contenuto interessante.\n\n## Esempi pratici\n- **Profilo social di un'azienda di moda**: Analisi di come l'uso di immagini accattivanti e influencer impatti sull'engagement.\n- **Profilo di un ristorante locale**: Osservazione dei post che generano più interazione, come offerte speciali e contest.\n- **Profilo di un professionista freelance**: Studio di come il networking e la condivisione di contenuti utili possano attirare clienti.\n\n## Riepilogo\nIn questa lezione pratica, i corsisti hanno analizzato profili social aziendali per identificare punti di forza e debolezza, hanno mappato le loro esperienze con i social media e hanno partecipato a un brainstorming collettivo sui contenuti coinvolgenti. Questo approccio pratico consente di applicare le nozioni teoriche in un contesto reale, preparandoli a gestire efficacemente le proprie strategie di social media marketing.",
          "objectives": [
            "Creare un profilo aziendale su almeno due piattaforme social media principali.",
            "Configurare e ottimizzare le impostazioni di base di un account social media per rispecchiare l'immagine del brand.",
            "Identificare e selezionare tre strumenti di analisi dei social media per monitorare le performance delle campagne.",
            "Progettare e programmare un calendario settimanale di contenuti social utilizzando strumenti di gestione dei social media.",
            "Applicare tecniche di targeting per definire un pubblico specifico per una campagna pubblicitaria sui social media."
          ],
          "materials": [
            "\"Social Media Marketing Workbook: How to Use Social Media for Business\" di Jason McDonald - Un libro pratico che fornisce esercizi e consigli utili per migliorare la presenza social di un'azienda.",
            "\"HubSpot's Free Social Media Certification Course\" - Un corso online gratuito che offre lezioni pratiche e consigli su come creare una strategia di social media efficace.",
            "\"Canva\" - Uno strumento online gratuito per creare contenuti visivi accattivanti per i social media, utile per esercitarsi nella creazione di post grafici.",
            "\"Buffer's Guide to Social Media Analytics\" - Un articolo dettagliato su come utilizzare gli strumenti di analisi per valutare le performance dei profili social, utile per l'esercizio di analisi dei profili.",
            "\"TED Talk: How to Get Your Ideas to Spread\" di Seth Godin - Un video che esplora cosa rende un contenuto virale e interessante, utile per il brainstorming collettivo.",
            "\"BuzzSumo\" - Uno strumento online che permette di analizzare quali contenuti sono più condivisi sui social media, utile per identificare punti di forza e debolezza nei profili analizzati."
          ],
          "exercises": [
            "Esercizio di analisi: Ogni gruppo analizza un profilo social aziendale diverso, elencando tre punti di forza e tre debolezze, e successivamente presenta i risultati al resto della classe.",
            "Workshop di mappatura: Crea una mappa visiva dei social media utilizzati dai partecipanti, identificando le esperienze positive e negative e discutendo come queste possono influenzare la strategia aziendale.",
            "Attività di brainstorming: In piccoli gruppi, elabora una lista di elementi che rendono un contenuto social interessante, poi confronta e discuti le idee con la classe.",
            "Esercizio di creazione: Scegli un prodotto o servizio e sviluppa un post social accattivante che integri i punti di forza identificati durante il brainstorming.",
            "Simulazione feedback: I gruppi si scambiano i post creati e forniscono feedback costruttivi, suggerendo miglioramenti basati sui principi discussi in classe."
          ],
          "lesson_date": null,
          "created_at": "2025-11-17T15:25:01.449321",
          "updated_at": null,
          "modification_count": 0
        },
        {
          "id": 3,
          "title": "Strategia di Social Media Marketing e target - Parte Teorica",
          "description": "Parte teorica del modulo 2",
          "lesson_type": "theory",
          "duration_hours": 6.0,
          "order": 3,
          "content": "- Obiettivi di Social Media Marketing: brand awareness, engagement, traffico, lead, vendite.\n- Obiettivi SMART: Specific, Measurable, Achievable, Relevant, Time-bound.\n- Analisi del target: demografia, interessi, comportamenti.\n- Buyer personas: cosa sono, a cosa servono, come crearle.\n- Posizionamento e tone of voice.\n- Elementi di una strategia social: obiettivi, target, canali, contenuti, risorse, tempi, KPI.\n\n---\n\n## Contenuto Dettagliato (Generato con ChatGPT)\n\n# Strategia di Social Media Marketing e target - Parte Teorica\n\n## Introduzione\nIl Social Media Marketing rappresenta uno strumento fondamentale per le aziende e i professionisti che desiderano aumentare la propria visibilità e interazione con il pubblico. In questa lezione, esploreremo come definire una strategia efficace, identificare il proprio target e stabilire obiettivi chiari e misurabili. \n\n## Contenuti Principali\n\n### 1. Obiettivi di Social Media Marketing\nGli obiettivi di Social Media Marketing possono variare a seconda delle necessità aziendali. Ecco i principali:\n\n- **Brand Awareness**: Aumentare la consapevolezza del marchio tra il pubblico target.\n- **Engagement**: Stimolare interazioni significative con il pubblico attraverso commenti, condivisioni e like.\n- **Traffico**: Guidare il traffico verso il sito web o altre piattaforme digitali.\n- **Lead Generation**: Raccogliere contatti di potenziali clienti interessati ai prodotti o servizi offerti.\n- **Vendite**: Incrementare le vendite dirette attraverso piattaforme social.\n\n### 2. Obiettivi SMART\nGli obiettivi SMART sono un modo efficace per garantire che ogni obiettivo sia ben definito e raggiungibile. Ecco la spiegazione di ciascuna componente:\n\n- **Specifico**: L’obiettivo deve essere chiaro e specifico. (Esempio: \"Aumentare il numero di follower su Instagram del 20%\").\n- **Misurabile**: Deve essere possibile misurare il progresso. (Esempio: \"Raggiungere 1.000 nuovi follower entro tre mesi\").\n- **Achievable (Raggiungibile)**: L’obiettivo deve essere realistico. (Esempio: \"Crescita del 20% è realizzabile rispetto ai dati storici\").\n- **Rilevante**: Deve essere allineato con le aspirazioni aziendali. (Esempio: \"Aumentare la presenza su Instagram per attrarre un pubblico più giovane\").\n- **Time-bound (Limitato nel tempo)**: Deve avere una scadenza. (Esempio: \"Entro il 30 giugno\").\n\n### 3. Analisi del Target\nIdentificare il proprio target è cruciale per una strategia di successo. La segmentazione può avvenire attraverso:\n\n- **Demografia**: Età, genere, posizione geografica, livello di istruzione.\n- **Interessi**: Hobby, passioni, preferenze di consumo.\n- **Comportamenti**: Modelli di acquisto, interazioni precedenti con il marchio.\n\n### 4. Buyer Personas\nLe buyer personas sono rappresentazioni semi-fittizie del cliente ideale. Servono a:\n\n- **Comprendere il pubblico**: Aiutano a capire chi sono i clienti e quali sono le loro necessità.\n- **Orientare le strategie**: Guidano la creazione di contenuti e campagne pubblicitarie.\n\n#### Come Creare una Buyer Persona\n1. **Raccogliere dati**: Interviste, sondaggi e analisi dei dati esistenti.\n2. **Identificare motivazioni e sfide**: Capire cosa spinge il cliente all'acquisto e quali ostacoli incontra.\n3. **Definire la persona**: Creare un profilo dettagliato (nome, età, professione, ecc.).\n\n### 5. Posizionamento e Tone of Voice\n- **Posizionamento**: Definire come si desidera essere percepiti dal pubblico rispetto ai concorrenti.\n- **Tone of Voice**: Stabilire il tono e lo stile della comunicazione (formale, informale, amichevole, professionale).\n\n### 6. Elementi di una Strategia Social\nUna strategia social efficace si compone di diversi elementi chiave:\n\n- **Obiettivi**: Cosa si vuole raggiungere.\n- **Target**: Chi è il pubblico.\n- **Canali**: Quali piattaforme utilizzare (Facebook, Instagram, LinkedIn, ecc.).\n- **Contenuti**: Tipo di contenuto da condividere (articoli, video, immagini).\n- **Risorse**: Budget e personale coinvolti.\n- **Tempi**: Scadenze e pianificazione.\n- **KPI**: Indicatori chiave di prestazione per misurare il successo.\n\n## Esempi Pratici\n- **Esempio di Obiettivo SMART**: \"Incrementare il tasso di engagement su Facebook del 15% entro la fine del trimestre mediante post interattivi.\"\n- **Esempio di Buyer Persona**: \"Giulia, 28 anni, social media manager, cerca contenuti su come migliorare la sua presenza online.\"\n\n## Riepilogo\nIn questa lezione, abbiamo esplorato l'importanza di definire obiettivi chiari e misurabili attraverso il modello SMART, l'analisi del target e la creazione di buyer personas. Abbiamo anche discusso il posizionamento e il tone of voice, oltre agli elementi costitutivi di una strategia di Social Media Marketing. Questi strumenti sono essenziali per costruire una strategia efficace e mirata che possa portare risultati tangibili.",
          "objectives": [
            "Definire obiettivi SMART per le attività social.",
            "Identificare il target e creare semplici buyer personas.",
            "Strutturare una strategia social di base."
          ],
          "materials": [],
          "exercises": [],
          "lesson_date": null,
          "created_at": "2025-11-17T15:25:01.449323",
          "updated_at": null,
          "modification_count": 0
        },
        {
          "id": 4,
          "title": "Strategia di Social Media Marketing e target - Parte Pratica",
          "description": "Parte pratica del modulo 2",
          "lesson_type": "practice",
          "duration_hours": 6.0,
          "order": 4,
          "content": "- Esercizio: definizione degli obiettivi social per un caso studio (es. negozio locale, freelance, e-commerce).\n- Creazione di 1–2 buyer personas per il caso studio selezionato.\n- Definizione del tone of voice e messaggi chiave.\n\n---\n\n## Contenuto Dettagliato (Generato con ChatGPT)\n\n# Strategia di Social Media Marketing e target - Parte Pratica\n\n## Introduzione\nIn questa lezione pratica, i partecipanti avranno l'opportunità di applicare le conoscenze teoriche acquisite nel modulo 2, concentrandosi sulla definizione di una strategia di social media marketing efficace. Attraverso esercizi pratici, i partecipanti esploreranno come definire gli obiettivi, creare buyer personas e stabilire un tone of voice appropriato per il loro pubblico di riferimento.\n\n## Contenuti principali\n\n### 1. Definizione degli obiettivi social\n#### 1.1 Esercizio pratico: Identificazione degli obiettivi\n- **Durata:** 1 ora\n- **Descrizione:** I partecipanti lavoreranno in gruppi per definire obiettivi specifici per un caso studio scelto (negozio locale, freelance, e-commerce). Utilizzeranno il modello SMART (Specifico, Misurabile, Achievable, Rilevante, Tempificato) per garantire che gli obiettivi siano chiari e raggiungibili.\n- **Esempio di obiettivi:**\n  - Aumentare il numero di follower del 20% in 3 mesi.\n  - Generare 50 lead tramite campagne pubblicitarie su Facebook in 1 mese.\n\n### 2. Creazione di buyer personas\n#### 2.1 Esercizio pratico: Sviluppo di buyer personas\n- **Durata:** 2 ore\n- **Descrizione:** I partecipanti creeranno 1-2 buyer personas per il caso studio selezionato. Questo esercizio aiuterà a comprendere meglio il pubblico di riferimento e a identificare le sue esigenze e comportamenti.\n- **Fasi dell'esercizio:**\n  - **Ricerca:** Utilizzare dati demografici, psicografici e comportamentali per costruire profili realistici.\n  - **Template:** Compilare un template di buyer persona che includa nome, età, professione, interessi, sfide e obiettivi.\n- **Esempio di buyer persona:**\n  - Nome: Laura, 34 anni, proprietaria di un negozio di abbigliamento, interessata alla moda sostenibile, cerca di attirare clienti giovani e consapevoli.\n\n### 3. Definizione del tone of voice e messaggi chiave\n#### 3.1 Esercizio pratico: Sviluppo del tone of voice\n- **Durata:** 2 ore\n- **Descrizione:** I partecipanti lavoreranno per definire il tone of voice del brand in base alle buyer personas create. Discuteranno come il tono può variare in base al canale di comunicazione e al pubblico.\n- **Fasi dell'esercizio:**\n  - **Brainstorming:** Discutere e annotare le caratteristiche del tone of voice (es. professionale, amichevole, informativo, divertente).\n  - **Messaggi chiave:** Ogni gruppo svilupperà 3-5 messaggi chiave che riflettono la missione e i valori del brand.\n- **Esempio di tone of voice:**\n  - Per un e-commerce di prodotti ecologici: \"Siamo qui per rendere la tua vita più verde, senza rinunciare allo stile!\"\n\n### 4. Presentazione dei risultati\n#### 4.1 Condivisione e feedback\n- **Durata:** 1 ora\n- **Descrizione:** Ogni gruppo presenterà le proprie scelte in termini di obiettivi, buyer personas e tone of voice. Gli altri partecipanti e il docente forniranno feedback costruttivo, favorendo un ambiente di apprendimento collaborativo.\n\n## Riepilogo\nIn questa lezione pratica, i partecipanti hanno avuto l'opportunità di applicare le teorie di social media marketing attraverso esercizi concreti. Hanno definito obiettivi specifici, creato buyer personas dettagliate e stabilito un tone of voice rappresentativo per il loro brand. Questi strumenti saranno fondamentali per sviluppare una strategia di social media marketing efficace e mirata, in grado di raggiungere e coinvolgere il pubblico desiderato.",
          "objectives": [],
          "materials": [],
          "exercises": [],
          "lesson_date": null,
          "created_at": "2025-11-17T15:25:01.449323",
          "updated_at": null,
          "modification_count": 0
        },
        {
          "id": 5,
          "title": "Piattaforme principali e gestione operativa - Parte Teorica",
          "description": "Parte teorica del modulo 3",
          "lesson_type": "theory",
          "duration_hours": 8.0,
          "order": 5,
          "content": "- Facebook & Instagram:\n- Pagine, profili, account professionali.\n- Struttura dei contenuti: post, stories, reel, caroselli.\n- Concetto di Business Manager / Business Suite.\n- TikTok:\n- Account, feed e “Per Te”.\n- Formati video brevi e trend.\n- LinkedIn:\n- Profili personali e pagine aziendali.\n- Contenuti professionali e networking.\n- Best practice generali:\n- Frequenza di pubblicazione.\n- Orari indicativi.\n- Interazione con la community (commenti, messaggi).\n\n---\n\n## Contenuto Dettagliato (Generato con ChatGPT)\n\n# Piattaforme principali e gestione operativa - Parte Teorica\n\n## Introduzione\nNella lezione di oggi, esploreremo le principali piattaforme di social media utilizzate nel marketing digitale per aziende e professionisti. Comprendere le caratteristiche specifiche di ciascuna piattaforma e come gestire operativamente i profili e le pagine aziendali è essenziale per massimizzare l'impatto delle proprie strategie di social media marketing.\n\n## Contenuti principali\n\n### 1. Facebook & Instagram\n#### 1.1 Pagine, profili, account professionali\n- **Pagine Facebook**: Strumenti per le aziende, consentono di interagire con clienti e utenti. Importante avere una descrizione chiara, contatti, e link al sito web.\n- **Profili personali**: Utilizzati per interazioni personali, non dovrebbero essere utilizzati per attività commerciali.\n- **Account professionali su Instagram**: Offrono funzionalità aggiuntive come analisi delle performance e promozione di post.\n\n#### 1.2 Struttura dei contenuti\n- **Post**: Contenuti testuali, immagini o video. Dovrebbero attirare l'attenzione e incoraggiare l'interazione.\n- **Stories**: Contenuti temporanei che scompaiono dopo 24 ore. Ottimi per mostrare aspetti quotidiani dell’azienda.\n- **Reel**: Video brevi, simili a TikTok, che possono diventare virali se utilizzati correttamente.\n- **Caroselli**: Post con più immagini o video scorrevoli, utili per raccontare una storia o presentare più prodotti.\n\n#### 1.3 Concetto di Business Manager / Business Suite\n- **Business Manager**: Strumento per gestire pagine, account pubblicitari e ruoli degli utenti in un unico luogo. Fondamentale per le aziende con più profili.\n- **Business Suite**: Unifica la gestione di Facebook e Instagram, facilitando la pianificazione e l'analisi dei contenuti.\n\n### 2. TikTok\n#### 2.1 Account, feed e “Per Te”\n- **Account TikTok**: È fondamentale creare un profilo aziendale per accedere a strumenti analitici.\n- **Feed**: Contenuti mostrati in base agli interessi e alle interazioni degli utenti.\n- **Sezione “Per Te”**: Algoritmo che suggerisce video. È cruciale creare contenuti accattivanti per essere visibili.\n\n#### 2.2 Formati video brevi e trend\n- **Video brevi**: Massimo 60 secondi. Utilizzare musiche di tendenza e challenge per aumentare la visibilità.\n- **Trend**: Partecipare a trend popolari per attrarre l'attenzione. Monitorare regolarmente i trend in evoluzione.\n\n### 3. LinkedIn\n#### 3.1 Profili personali e pagine aziendali\n- **Profili personali**: Strumenti per costruire una rete professionale. Importante avere un’immagine professionale e una descrizione chiara delle competenze.\n- **Pagine aziendali**: Utilizzate per condividere aggiornamenti aziendali, notizie e opportunità di lavoro.\n\n#### 3.2 Contenuti professionali e networking\n- **Contenuti professionali**: Articoli, post e aggiornamenti su progetti. Dovrebbero posizionare l'azienda come esperta nel settore.\n- **Networking**: Interagire con altri professionisti, commentare post e partecipare a gruppi di settore.\n\n### 4. Best practice generali\n#### 4.1 Frequenza di pubblicazione\n- **Facebook/Instagram**: Consigliato 3-5 post a settimana per mantenere l’engagement.\n- **LinkedIn**: 1-2 post a settimana per un pubblico professionale.\n\n#### 4.2 Orari indicativi\n- **Facebook**: Mercoledì e giovedì tra le 11:00 e le 14:00.\n- **Instagram**: Lunedì e giovedì tra le 11:00 e le 13:00.\n- **LinkedIn**: Martedì, mercoledì e giovedì tra le 8:00 e le 10:00.\n\n#### 4.3 Interazione con la community\n- **Commenti**: Rispondere a commenti e messaggi per costruire relazioni con i follower.\n- **Messaggi**: Utilizzare messaggi diretti per comunicazioni più personali e dirette.\n\n## Esempi pratici\n- **Creazione di una pagina Facebook**: Guidare i partecipanti nella creazione di una pagina aziendale, evidenziando le sezioni da compilare.\n- **Piano di contenuti per Instagram**: Chiedere ai partecipanti di redigere un piano di contenuti per la settimana.\n\n## Riepilogo\nIn questa lezione abbiamo esplorato le principali piattaforme di social media, analizzando le loro caratteristiche e come gestirle operativamente. Abbiamo discusso le migliori pratiche per la pubblicazione e l'interazione con la community. Queste conoscenze sono fondamentali per costruire una presenza online efficace e coinvolgente.",
          "objectives": [
            "Conoscere le caratteristiche principali delle piattaforme più usate.",
            "Impostare e ottimizzare profili e pagine aziendali.",
            "Gestire operativamente la pubblicazione di contenuti base."
          ],
          "materials": [],
          "exercises": [],
          "lesson_date": null,
          "created_at": "2025-11-17T15:25:01.449324",
          "updated_at": null,
          "modification_count": 0
        },
        {
          "id": 6,
          "title": "Piattaforme principali e gestione operativa - Parte Pratica",
          "description": "Parte pratica del modulo 3",
          "lesson_type": "practice",
          "duration_hours": 12.0,
          "order": 6,
          "content": "- Creazione o ottimizzazione di:\n- Pagina Facebook aziendale (reale o simulata).\n- Profilo Instagram professionale.\n- Impostazione di:\n- Biografia, immagine profilo e copertina.\n- Link in bio, informazioni aziendali, contatti.\n- Esercizio: creare un piano di 10 post base per una sola piattaforma (titolo, format, obiettivo).\n- Simulazione: gestione commenti e messaggi (customer care base).\n\n---\n\n## Contenuto Dettagliato (Generato con ChatGPT)\n\n# Lezione Pratica: Piattaforme Principali e Gestione Operativa\n\n## Introduzione\nIn questa lezione pratica, ci concentreremo sulle piattaforme principali di social media e sulla loro gestione operativa. Gli studenti avranno l'opportunità di creare e ottimizzare una pagina Facebook aziendale e un profilo Instagram professionale, oltre a impostare correttamente le informazioni chiave e sviluppare contenuti strategici. Attraverso esercizi pratici e simulazioni, acquisiranno competenze fondamentali per gestire la presenza online delle aziende e dei professionisti.\n\n## Contenuti Principali\n\n### 1. Creazione o Ottimizzazione di Piattaforme Social\n\n#### 1.1 Pagina Facebook Aziendale\n- **Creazione di una Pagina**: Guida passo passo alla creazione di una pagina Facebook aziendale, incluso il selezionare la categoria corretta (es. azienda locale, negozio, organizzazione).\n- **Ottimizzazione della Pagina**:\n  - **Immagine del Profilo**: Importanza del logo aziendale e delle dimensioni appropriate.\n  - **Immagine di Copertina**: Creare una copertina accattivante che rappresenti il brand.\n  - **Informazioni Aziendali**: Compilare le sezioni \"Informazioni\", \"Orari di apertura\", \"Contatti\".\n\n#### 1.2 Profilo Instagram Professionale\n- **Creazione di un Profilo**: Trasformare un profilo personale in un profilo professionale.\n- **Ottimizzazione del Profilo**:\n  - **Biografia**: Scrivere una biografia chiara e concisa che comunichi il valore del brand.\n  - **Immagine del Profilo**: Utilizzare il logo aziendale o un'immagine rappresentativa.\n  - **Link in Bio**: Importanza del link in bio e strumenti utili (es. Linktree).\n\n### 2. Impostazione delle Informazioni Chiave\n- **Dettagli di Contatto**: Aggiungere email, numero di telefono e link al sito web.\n- **Informazioni Aziendali**: Descrivere mission e valori aziendali in modo accattivante.\n- **Call to Action**: Impostare bottoni per azioni specifiche (es. \"Contattaci\", \"Prenota ora\").\n\n### 3. Creazione di Contenuti\n- **Piano di 10 Post**:\n  - **Esercizio**: Ogni studente deve creare un piano di 10 post per una delle piattaforme esaminate. Ogni post deve includere:\n    - Titolo\n    - Format (es. immagine, video, carosello)\n    - Obiettivo (es. aumentare la consapevolezza, promuovere un evento).\n  - **Discussione**: Condividere i piani in piccoli gruppi e fornire feedback.\n\n### 4. Simulazione: Gestione Commenti e Messaggi\n- **Customer Care Base**:\n  - **Gestione dei Commenti**: Simulazione di risposte a commenti sia positivi che negativi.\n  - **Gestione dei Messaggi Diretti**: Esercizio sulla creazione di risposte predefinite per domande frequenti e gestione delle interazioni più complesse.\n\n## Esempi Pratici\n### Esempio di Piano di Post\n- **Post 1**: \n  - Titolo: \"Benvenuti nel nostro negozio!\"\n  - Format: Video di presentazione del negozio\n  - Obiettivo: Aumentare la consapevolezza del brand\n- **Post 2**: \n  - Titolo: \"Scopri i nostri prodotti!\"\n  - Format: Carosello con immagini di prodotti\n  - Obiettivo: Promuovere i prodotti\n\n### Esempio di Gestione Commenti\n- **Commento Positivo**: \"Adoro i vostri prodotti!\"\n  - Risposta: \"Grazie mille! Siamo felici che ti piacciano! 😊\"\n- **Commento Negativo**: \"Ho avuto un problema con un ordine.\"\n  - Risposta: \"Ci dispiace per l'inconveniente. Ti preghiamo di inviarci un messaggio diretto per assistenza.\"\n\n## Riepilogo\nIn questa lezione pratica, abbiamo approfondito la creazione e ottimizzazione di una pagina Facebook aziendale e di un profilo Instagram professionale. Gli studenti hanno imparato a impostare informazioni chiave, creare un piano di contenuti e gestire le interazioni con il pubblico. Queste competenze sono fondamentali per una gestione efficace delle piattaforme social e per costruire una presenza online solida e professionale.",
          "objectives": [],
          "materials": [],
          "exercises": [],
          "lesson_date": null,
          "created_at": "2025-11-17T15:25:01.449324",
          "updated_at": null,
          "modification_count": 0
        },
        {
          "id": 7,
          "title": "Content creation: copy, visual e video brevi - Parte Teorica",
          "description": "Parte teorica del modulo 4",
          "lesson_type": "theory",
          "duration_hours": 6.0,
          "order": 7,
          "content": "- Copywriting per i social:\n- Struttura di un post (hook, sviluppo, call to action).\n- Linguaggio e tono di voce.\n- Hashtag: cosa sono, come usarli con criterio.\n- Visual design base:\n- Principi semplici di composizione, gerarchia visiva, leggibilità.\n- Formati immagine più usati.\n- Video brevi:\n- Idee e format (tutorial, dietro le quinte, recensioni, storytelling).\n- Storyboard minimale: inizio, parte centrale, chiusura.\n\n---\n\n## Contenuto Dettagliato (Generato con ChatGPT)\n\n# Content creation: copy, visual e video brevi - Parte Teorica\n\n## Introduzione\nLa creazione di contenuti efficaci è fondamentale per il successo delle strategie di social media marketing. Durante questa lezione, esploreremo le tecniche di copywriting, il design visivo e la produzione di brevi video, fornendo ai partecipanti le competenze necessarie per attrarre e coinvolgere il pubblico sui vari social media.\n\n## Obiettivi della lezione\n- Scrivere testi efficaci per social diversi.\n- Creare grafiche semplici, caroselli e stories.\n- Progettare e realizzare brevi video verticali.\n\n## Contenuti principali\n\n### 1. Copywriting per i social\n#### 1.1 Struttura di un post\n- **Hook**: L'elemento che cattura l'attenzione. Può essere una domanda provocatoria, un'affermazione sorprendente o un fatto interessante.\n  - *Esempio*: \"Sai che il 70% delle persone non legge mai un articolo completo?\"\n- **Sviluppo**: Il corpo del messaggio deve fornire informazioni utili e pertinenti, mantenendo il lettore interessato.\n  - *Esempio*: \"Scopri come migliorare la tua strategia di marketing sui social media con i nostri consigli pratici.\"\n- **Call to Action (CTA)**: Invito all'azione chiaro e diretto. Deve stimolare il lettore a compiere un'azione specifica.\n  - *Esempio*: \"Visita il nostro sito per saperne di più!\"\n\n#### 1.2 Linguaggio e tono di voce\n- Importanza di adattare il linguaggio in base al target di riferimento. \n- Differenze tra un tono formale e uno informale, e come scegliere quello giusto per il proprio brand.\n  - *Esempio*: Un brand di lusso utilizzerà un linguaggio più elegante rispetto a un'azienda giovanile e dinamica.\n\n#### 1.3 Hashtag: cosa sono e come usarli con criterio\n- Definizione e funzione degli hashtag: categorizzare i contenuti e aumentare la visibilità.\n- Linee guida per l'uso efficace: \n  - Utilizzare hashtag pertinenti e specifici.\n  - Non esagerare: da 5 a 10 hashtag sono solitamente sufficienti.\n  - *Esempio*: Per un post su ricette vegan, utilizzare hashtag come #VeganRecipes, #HealthyEating, #PlantBased.\n\n### 2. Visual design base\n#### 2.1 Principi di composizione\n- Regola dei terzi: suddivisione dell'immagine in nove parti uguali per creare equilibrio.\n- Uso dello spazio negativo per enfatizzare il soggetto principale.\n\n#### 2.2 Gerarchia visiva\n- Creare un percorso visivo per guidare l'osservatore attraverso l'immagine.\n- Importanza di evidenziare le informazioni chiave con dimensioni, colori e posizionamento.\n\n#### 2.3 Leggibilità\n- Font appropriati: scegliere caratteri chiari e leggibili, evitando quelli troppo decorativi.\n- Contrasto tra il testo e lo sfondo per facilitare la lettura.\n\n#### 2.4 Formati immagine più usati\n- Dimensioni e risoluzioni ottimali per i vari social media (Instagram, Facebook, LinkedIn, Twitter).\n- Importanza del formato quadrato per Instagram e delle immagini verticali per le stories.\n\n### 3. Video brevi\n#### 3.1 Idee e format\n- **Tutorial**: Brevi video che mostrano come fare qualcosa (es. ricette, DIY).\n- **Dietro le quinte**: Mostrare il processo di creazione di un prodotto o servizio.\n- **Recensioni**: Condividere opinioni su prodotti o servizi, incoraggiando l'interazione.\n- **Storytelling**: Raccontare una storia avvincente relativa al brand o ai clienti.\n\n#### 3.2 Storyboard minimale\n- Importanza dello storyboard come strumento di pianificazione.\n- Struttura:\n  - **Inizio**: Presentazione del tema e cattura dell'attenzione.\n  - **Parte centrale**: Sviluppo del contenuto, mantenendo alta l'attenzione.\n  - **Chiusura**: Riassunto e CTA finale.\n  - *Esempio*: Per un video tutorial su un prodotto, iniziare presentando il prodotto, mostrare il suo utilizzo e concludere invitando a seguirti per ulteriori consigli.\n\n## Esempi pratici\n- Analisi di post reali sui social media per identificare gli elementi di successo (hook, sviluppo, CTA).\n- Creazione di un mockup di un post grafico seguendo le linee guida di design discusse.\n- Progettazione di un breve video, scrivendo uno storyboard e discutendo le idee di contenuto.\n\n## Riepilogo\nIn questa lezione abbiamo approfondito le tecniche di copywriting, il design visivo e la produzione di video brevi. Queste competenze sono essenziali per creare contenuti coinvolgenti e di qualità sui social media, contribuendo al successo delle strategie di marketing delle aziende e dei professionisti. Durante la prossima lezione, applicheremo queste tecniche in esercizi pratici per consolidare quanto appreso.",
          "objectives": [
            "Scrivere testi efficaci per social diversi.",
            "Creare grafiche semplici, caroselli e stories.",
            "Progettare e realizzare brevi video verticali."
          ],
          "materials": [],
          "exercises": [],
          "lesson_date": null,
          "created_at": "2025-11-17T15:25:01.449325",
          "updated_at": null,
          "modification_count": 0
        },
        {
          "id": 8,
          "title": "Content creation: copy, visual e video brevi - Parte Pratica",
          "description": "Parte pratica del modulo 4",
          "lesson_type": "practice",
          "duration_hours": 10.0,
          "order": 8,
          "content": "- Utilizzo di uno strumento online per la creazione di grafiche (es. tool di design online).\n- Creazione di:\n- 1 carosello per Instagram.\n- 2 stories con elementi grafici e testo.\n- Scrittura collettiva di testi per 5 post con obiettivi diversi.\n- Progettazione e registrazione (anche solo simulata) di 1 breve video verticale per reel/TikTok:\n- Definizione struttura.\n- Testo parlato / overlay di testo.\n\n---\n\n## Contenuto Dettagliato (Generato con ChatGPT)\n\n# Content creation: copy, visual e video brevi - Parte Pratica\n\n## Introduzione\nIn questa lezione pratica di 10 ore, ci concentreremo sulla creazione di contenuti per i social media, utilizzando strumenti online per la grafica e la produzione di video brevi. Gli studenti apprenderanno a realizzare grafiche accattivanti, scrivere copy efficace e progettare video brevi per piattaforme come Instagram e TikTok.\n\n## Contenuti principali\n\n### 1. Utilizzo di uno strumento online per la creazione di grafiche\n- **Strumenti consigliati**: Canva, Adobe Spark, Crello.\n- **Obiettivo**: Familiarizzare con l'interfaccia e le funzionalità di base.\n- **Attività**:\n  - Creazione di un account e navigazione nell'interfaccia.\n  - Esplorazione di modelli predefiniti e opzioni di personalizzazione.\n\n### 2. Creazione di un carosello per Instagram\n- **Definizione**: Un carosello è un post che consente di caricare più immagini o grafiche in un'unica pubblicazione.\n- **Obiettivo**: Realizzare un carosello di 5 slide su un tema scelto (es. promozione di un prodotto/servizio).\n- **Attività**:\n  - Scegliere un tema e definire il messaggio centrale.\n  - Creare 5 grafiche seguendo una coerenza visiva (colori, font, stile).\n  - Aggiungere call-to-action su ogni slide.\n\n### 3. Creazione di 2 stories con elementi grafici e testo\n- **Definizione**: Le stories sono contenuti temporanei che scompaiono dopo 24 ore, perfetti per comunicazioni dirette e coinvolgenti.\n- **Obiettivo**: Realizzare due stories per comunicare un messaggio o un evento.\n- **Attività**:\n  - Scegliere un messaggio per ogni story.\n  - Creare una grafica accattivante per ciascuna story, includendo testo e immagini.\n  - Aggiungere adesivi, sondaggi o domande interattive per aumentare il coinvolgimento.\n\n### 4. Scrittura collettiva di testi per 5 post con obiettivi diversi\n- **Obiettivo**: Sviluppare capacità di copywriting per vari scopi (vendita, informazione, intrattenimento, coinvolgimento, brand awareness).\n- **Attività**:\n  - Formare gruppi di lavoro e assegnare un obiettivo a ciascun gruppo.\n  - Brainstorming collettivo per generare idee di copy.\n  - Scrittura e revisione dei testi, assicurandosi che siano concisi e diretti.\n\n### 5. Progettazione e registrazione (anche solo simulata) di 1 breve video verticale per reel/TikTok\n- **Definizione**: I video brevi sono estremamente efficaci per catturare l'attenzione e comunicare messaggi rapidamente.\n- **Obiettivo**: Creare un video di massimo 30 secondi per promuovere un prodotto/servizio o raccontare una storia.\n- **Attività**:\n  - **Definizione della struttura**: Creare un copione che includa introduzione, messaggio centrale e conclusione.\n  - **Testo parlato / overlay di testo**: Scrivere il testo da pronunciare e il testo da sovrapporre nel video.\n  - **Registrazione**: Utilizzare smartphone o webcam per registrare il video, prestando attenzione all'illuminazione e al suono.\n\n## Esempi pratici\n- **Carosello Instagram**: Creare un carosello per un nuovo prodotto, mostrando le sue caratteristiche principali in modo visivo.\n- **Stories**: Progettare una story per annunciare un evento imminente utilizzando immagini, testo e adesivi.\n- **Post di copywriting**: Scrivere un post che invita gli utenti a commentare la loro opinione su un argomento di tendenza.\n- **Video breve**: Realizzare un video di presentazione del proprio business, includendo dati e testimonianze.\n\n## Riepilogo\nIn questa lezione pratica abbiamo esplorato le tecniche fondamentali per la creazione di contenuti visivi e testuali per i social media. Attraverso l'uso di strumenti online, la scrittura collettiva e la progettazione di video brevi, gli studenti hanno acquisito competenze pratiche che possono applicare immediatamente nel contesto professionale. La capacità di produrre contenuti coinvolgenti è essenziale per il successo nel social media marketing.",
          "objectives": [],
          "materials": [],
          "exercises": [],
          "lesson_date": null,
          "created_at": "2025-11-17T15:25:01.449326",
          "updated_at": null,
          "modification_count": 0
        },
        {
          "id": 9,
          "title": "Introduzione alle sponsorizzazioni e analytics - Parte Teorica",
          "description": "Parte teorica del modulo 5",
          "lesson_type": "theory",
          "duration_hours": 8.0,
          "order": 9,
          "content": "- Organico vs sponsorizzato: differenze e quando usare cosa.\n- Concetti chiave delle campagne:\n- Budget, durata, pubblico, posizionamenti.\n- Obiettivi di campagna (traffico, interazioni, visualizzazioni video, lead).\n- Panoramica delle politiche pubblicitarie (linee guida generali).\n- Introduzione all’analisi dati:\n- Reach, impressions, engagement, click, CTR, conversioni di base.\n- Lettura delle statistiche dei contenuti.\n\n---\n\n## Contenuto Dettagliato (Generato con ChatGPT)\n\n# Introduzione alle sponsorizzazioni e analytics - Parte Teorica\n\n## Introduzione\nNel panorama attuale del marketing digitale, le sponsorizzazioni sui social media rappresentano una delle strategie più efficaci per raggiungere un pubblico mirato e generare risultati tangibili. Questa lezione esplorerà i fondamenti delle campagne pubblicitarie a pagamento sui social media, fornendo gli strumenti necessari per comprendere e analizzare i dati relativi alle performance delle proprie campagne.\n\n## Contenuti principali\n\n### 1. Organico vs Sponsorizzato\n- **Definizione di contenuto organico**: post e interazioni generate senza investimenti monetari.\n- **Definizione di contenuto sponsorizzato**: pubblicità a pagamento per aumentare la visibilità e raggiungere un pubblico più ampio.\n- **Differenze principali**:\n  - **Portata**: i contenuti organici raggiungono solo i follower esistenti, mentre i contenuti sponsorizzati possono raggiungere nuovi utenti.\n  - **Costi**: i contenuti organici non comportano costi diretti, i contenuti sponsorizzati richiedono un budget definito.\n  - **Tempistiche**: i risultati dei contenuti organici possono richiedere tempo per manifestarsi, mentre le campagne sponsorizzate possono generare risultati immediati.\n- **Quando usare cosa**: \n  - Utilizzare contenuti organici per costruire relazioni a lungo termine con il pubblico.\n  - Utilizzare contenuti sponsorizzati per lanciare promozioni, raggiungere nuovi clienti o aumentare la visibilità di eventi specifici.\n\n### 2. Concetti chiave delle campagne\n- **Budget**: definire quanto si è disposti a spendere. Tipi di budget: giornaliero, totale.\n- **Durata**: determinare quanto a lungo si desidera che la campagna duri.\n- **Pubblico**: identificare il target demografico, interessi e comportamenti. Uso di strumenti di targeting disponibili su ciascuna piattaforma.\n- **Posizionamenti**: scegliere dove visualizzare gli annunci (es. Feed, Stories, colonne laterali).\n\n### 3. Obiettivi di campagna\n- **Traffico**: indirizzare gli utenti verso il sito web.\n- **Interazioni**: aumentare il numero di like, commenti e condivisioni.\n- **Visualizzazioni video**: massimizzare il numero di visualizzazioni per i contenuti video.\n- **Lead**: raccogliere informazioni di contatto per future comunicazioni.\n\n### 4. Panoramica delle politiche pubblicitarie\n- **Linee guida generali**: ogni piattaforma ha regole specifiche riguardo contenuti e formati consentiti.\n- **Importanza della conformità**: evitare la sospensione dell'account pubblicitario o la rimozione dei contenuti.\n\n### 5. Introduzione all’analisi dati\n- **Reach**: numero totale di utenti che hanno visto il contenuto.\n- **Impressions**: quante volte il contenuto è stato visualizzato, comprese le visualizzazioni ripetute.\n- **Engagement**: interazioni totali (like, commenti, condivisioni).\n- **Click**: numero di clic sugli annunci o sui link.\n- **CTR (Click-Through Rate)**: percentuale di clic rispetto alle impressioni.\n- **Conversioni di base**: azioni desiderate completate dagli utenti (es. iscrizioni, acquisti).\n\n### 6. Lettura delle statistiche dei contenuti\n- **Utilizzo dei pannelli di analisi**: come accedere e interpretare i dati forniti dalle piattaforme.\n- **Metriche chiave da monitorare**: identificare quali metriche sono più rilevanti per i propri obiettivi.\n- **Esempi di report**: come costruire un report efficace per analizzare le performance delle campagne.\n\n## Esempi pratici\n- **Caso studio**: analisi di una campagna pubblicitaria di un'azienda locale, evidenziando obiettivi, budget, risultati ottenuti e metriche chiave.\n- **Esercizio di gruppo**: creare un piano di campagna pubblicitaria per un prodotto o servizio, definendo budget, obiettivi e target.\n\n## Riepilogo\nIn questa lezione abbiamo esplorato i fondamenti delle sponsorizzazioni sui social media, distinguendo tra contenuti organici e sponsorizzati. Abbiamo discusso i principali componenti delle campagne pubblicitarie, gli obiettivi da raggiungere e le politiche da seguire. Infine, abbiamo introdotto l'analisi dei dati, fornendo le basi per interpretare le performance delle campagne e prendere decisioni informate basate sui risultati. Questi concetti saranno fondamentali per la fase pratica del corso, dove applicheremo le conoscenze acquisite alla creazione e gestione di campagne reali.",
          "objectives": [
            "Comprendere i principi base della pubblicità a pagamento sui social.",
            "Conoscere le principali metriche per valutare campagne e contenuti.",
            "Muovere i primi passi nella lettura degli insights delle piattaforme."
          ],
          "materials": [],
          "exercises": [],
          "lesson_date": null,
          "created_at": "2025-11-17T15:25:01.449326",
          "updated_at": null,
          "modification_count": 0
        },
        {
          "id": 10,
          "title": "Introduzione alle sponsorizzazioni e analytics - Parte Pratica",
          "description": "Parte pratica del modulo 5",
          "lesson_type": "practice",
          "duration_hours": 4.0,
          "order": 10,
          "content": "- Lettura guidata di un pannello “Insight” di una pagina social (esempio o caso reale).\n- Analisi di un set di post: quali hanno funzionato meglio e perché.\n- Esercizio: simulazione “su carta” della struttura di una campagna (obiettivo, pubblico, messaggio, creatività, budget).\n\n---\n\n## Contenuto Dettagliato (Generato con ChatGPT)\n\n# Introduzione alle sponsorizzazioni e analytics - Parte Pratica\n\n## Introduzione\nNel contesto attuale del marketing digitale, comprendere come analizzare i dati e utilizzare le sponsorizzazioni sui social media è fondamentale per il successo di qualsiasi strategia di marketing. Questa lezione pratica si propone di fornire ai partecipanti gli strumenti necessari per interpretare i dati delle proprie campagne e per strutturare sponsorizzazioni efficaci.\n\n## Contenuti principali\n\n### 1. Lettura guidata del pannello \"Insight\"\n   - **Obiettivo:** Comprendere come leggere e interpretare i dati forniti dagli strumenti di analisi delle pagine social.\n   - **Attività:**\n     - Presentazione di un caso reale: selezionare una pagina social di un'azienda locale o di una campagna di successo.\n     - Guidare i partecipanti attraverso il pannello \"Insight\" di Facebook o Instagram, evidenziando le metriche chiave come copertura, interazioni, clic sul link e tasso di engagement.\n     - Discussione di come ciascuna metrica può influenzare le decisioni future relative ai contenuti e alle sponsorizzazioni.\n\n### 2. Analisi di un set di post\n   - **Obiettivo:** Identificare quali post hanno avuto più successo e comprendere le ragioni dietro alle performance.\n   - **Attività:**\n     - Fornire un set di post (realistici o storici) da analizzare in gruppo.\n     - Guidare i partecipanti nell'analisi delle seguenti metriche:\n       - Tipo di contenuto (immagine, video, testo)\n       - Orario di pubblicazione\n       - Target di pubblico\n       - Tipologia di call-to-action (CTA)\n     - Discussione: quali post hanno funzionato meglio e perché? Cosa si può imparare per le future campagne?\n\n### 3. Esercizio: Simulazione della struttura di una campagna\n   - **Obiettivo:** Applicare le conoscenze apprese per sviluppare una campagna sponsorizzata.\n   - **Attività:**\n     - Dividere i partecipanti in piccoli gruppi.\n     - Ogni gruppo dovrà creare una scheda di progetto su carta che includa:\n       - **Obiettivo della campagna:** ad esempio, aumentare la brand awareness o promuovere un prodotto specifico.\n       - **Pubblico target:** definire demografia, interessi e comportamenti.\n       - **Messaggio:** redigere un messaggio chiaro e accattivante.\n       - **Creatività:** ideare il tipo di contenuto visivo o testuale.\n       - **Budget:** pianificare un budget ipotetico per la sponsorizzazione e giustificare le scelte fatte.\n     - Presentazione delle campagne create da ciascun gruppo e feedback da parte del docente e dei compagni.\n\n## Esempi pratici\n- **Caso reale di analisi post:** Analizzare una campagna pubblicitaria di un'azienda locale su Facebook, discutendo quali elementi hanno portato al suo successo.\n- **Simulazione di campagna:** Utilizzare strumenti di progettazione come Canva per creare grafiche da allegare alla campagna proposta.\n\n## Riepilogo\nLa lezione pratica ha fornito agli studenti le competenze necessarie per analizzare le performance delle proprie campagne sui social media, comprendere le metriche chiave e sviluppare una campagna pubblicitaria completa. Questi strumenti consentiranno loro di migliorare l'efficacia delle loro strategie di marketing e ottimizzare il ritorno sugli investimenti pubblicitari.",
          "objectives": [],
          "materials": [],
          "exercises": [],
          "lesson_date": null,
          "created_at": "2025-11-17T15:25:01.449326",
          "updated_at": null,
          "modification_count": 0
        },
        {
          "id": 11,
          "title": "Project work, simulazione cliente ed esame finale - Parte Teorica",
          "description": "Parte teorica del modulo 6",
          "lesson_type": "theory",
          "duration_hours": 4.0,
          "order": 11,
          "content": "",
          "objectives": [
            "Applicare l’intero percorso formativo a un caso concreto.",
            "Sviluppare un mini progetto di Social Media Marketing completo.",
            "Presentare il proprio lavoro in modo professionale."
          ],
          "materials": [],
          "exercises": [],
          "lesson_date": null,
          "created_at": "2025-11-17T15:25:01.449327",
          "updated_at": null,
          "modification_count": 0
        },
        {
          "id": 12,
          "title": "Project work, simulazione cliente ed esame finale - Parte Pratica",
          "description": "Parte pratica del modulo 6",
          "lesson_type": "practice",
          "duration_hours": 4.0,
          "order": 12,
          "content": "**Ripasso teorico (breve):**\n- Riepilogo dei concetti chiave:\n- Strategia, target, obiettivi.\n- Piano editoriale.\n- Content creation.\n- Metriche principali.\n**Project work:**\nOgni corsista (o gruppo di 2–3 persone) realizza per un caso reale o simulato:\n1. Definizione del progetto:\n- Descrizione dell’attività/brand.\n- Target e obiettivi social.\n2. Piano editoriale sintetico per 1 mese:\n- Canali scelti.\n- Rubriche principali.\n- Calendario di massima con almeno 12–15 contenuti.\n3. Produzione di alcuni contenuti di esempio:\n- 2–3 post con copy e visual.\n- 1 carosello.\n- 1 bozza di video breve (storyboard o mockup).\n4. Analisi delle metriche “obiettivo”:\n- Quali KPI monitorare e perché.\n**Presentazione finale:**\n- Presentazione orale del progetto (5–10 minuti per gruppo/partecipante).\n- Feedback strutturato da parte del docente.\n- **Valutazione continua (40%)**\n- Partecipazione attiva in aula e laboratorio.\n- Consegna esercitazioni intermedie.\n- **Project work (40%)**\n- Completezza della strategia.\n- Coerenza tra obiettivi, target e contenuti.\n- Qualità dei materiali prodotti.\n- **Colloquio finale (20%)**\n- Comprensione dei concetti chiave.\n- Capacità di argomentare le scelte fatte.\n---\n## 5. Metodologia didattica (guida per il docente)\nQuesta sezione è pensata come guida operativa per chi dovrà erogare il corso.\n### 5.1 Approccio generale\n- Alternare costantemente teoria e pratica nella stessa lezione quando possibile.\n- Utilizzare esempi reali (aziende locali, brand noti, profili dei corsisti dove appropriato).\n- Lavorare spesso a piccoli gruppi per stimolare confronto e creatività.\n- Fornire template e schede operative (piano editoriale, scheda persona, scheda contenuto).\n### 5.2 Strumenti consigliati\n- Aule con:\n- PC connessi a internet (1 ogni 1–2 corsisti).\n- Proiettore / schermo per il docente.\n- Strumenti digitali (preferibilmente gratuiti o con versioni free):\n- Tool per grafica online.\n- Fogli di calcolo per calendario editoriale.\n- Materiale didattico:\n- Slide riassuntive per ogni modulo.\n- Schede esercizi stampabili o in formato digitale.\n- Esempi di piani editoriali e contenuti ben strutturati.\n### 5.3 Struttura tipo di una lezione da 4 ore\nEsempio di schema ripetibile:\n1. **30–45 min – Ripasso e teoria**\n- Richiamo dei concetti chiave della lezione precedente.\n- Introduzione del tema della giornata.\n2. **60–90 min – Dimostrazione e esempi guidati**\n- Il docente mostra passaggi operativi o analizza casi reali.\n3. **60–90 min – Laboratorio pratico**\n- I corsisti lavorano su esercizi singoli o di gruppo.\n- Il docente passa tra i banchi per assistenza.\n4. **15–30 min – Condivisione e sintesi**\n- Presentazione veloce di alcuni lavori.\n- Feedback e indicazioni sul lavoro da completare.\n### 5.4 Gestione del project work\n- Definire il progetto entro la metà del corso (dopo il Modulo 3).\n- Far lavorare i corsisti sul progetto in modo trasversale:\n- Durante il Modulo 4 sui contenuti.\n- Durante il Modulo 5 su obiettivi e metriche.\n- Tenere traccia delle consegne intermedie:\n- Bozza di strategia.\n- Bozza di piano editoriale.\n- Bozza di contenuti.\n---\n## 6. Schema sintetico per uso “generatore di corsi”\nQuesta sezione descrive la struttura astratta che un programma di generazione corsi può usare, a partire da questo esempio.\n### 6.1 Struttura logica del corso\n1. **Metadati corso**\n- Titolo\n- Durata totale (ore)\n- Ripartizione teoria / pratica\n- Destinatari\n- Prerequisiti\n- Obiettivi generali\n2. **Competenze in uscita**\n- Elenco di abilità e conoscenze che il corsista avrà alla fine.\n3. **Moduli**\n- Per ogni modulo:\n- Titolo\n- Durata totale\n- Ore teoria\n- Ore laboratorio\n- Obiettivi specifici\n- Contenuti teorici\n- Attività di laboratorio\n- Risultati attesi\n4. **Metodologia didattica**\n- Approccio generale\n- Strumenti necessari\n- Esempio di struttura di lezione\n5. **Valutazione**\n- Componenti della valutazione (continua, project work, esame)\n- Percentuali e criteri\n---\n## 7. Output atteso dal corsista\nAlla fine del corso, ogni partecipante dovrebbe avere:\n1. Un **mini piano strategico social** per un caso reale o simulato.\n2. Un **piano editoriale di 1 mese** con contenuti organizzati.\n3. Un set di **contenuti esempio** (copy + visual + idea video).\n4. Una **scheda di auto-valutazione** delle competenze acquisite.\n---\n_Fine del documento._",
          "objectives": [],
          "materials": [],
          "exercises": [],
          "lesson_date": null,
          "created_at": "2025-11-17T15:25:01.449327",
          "updated_at": null,
          "modification_count": 0
        }
      ]
    },
    {
      "id": 2,
      "code": "INFORMATICHESE",
      "name": "",
      "description": "",
      "total_hours": 80,
      "theory_hours": 40,
      "practice_hours": 40,
      "num_lessons": 0,
      "created_at": "2025-11-17T17:06:04.048173",
      "export_count": 1,
      "lessons": [
        {
          "id": 13,
          "title": "Lezione di benvenuto",
          "description": "",
          "lesson_type": "theory",
          "duration_hours": 2.0,
          "order": 1,
          "content": "Benvenuti a sti corsisti",
          "objectives": [],
          "materials": [],
          "exercises": [],
          "lesson_date": "2025-11-20",
          "created_at": "2025-11-17T17:06:04.052253",
          "updated_at": "2025-11-19T11:04:18.501852",
          "modification_count": 3
        },
        {
          "id": 14,
          "title": "Fondamenti di informatica e pensiero computazionale",
          "description": "",
          "lesson_type": "theory",
          "duration_hours": 2.0,
          "order": 3,
          "content": "## Cos’è l’informatica\nL’informatica è la scienza che studia il trattamento automatico dell’informazione:\n- come i dati vengono rappresentati\n- come vengono elaborati tramite algoritmi e programmi\n- come vengono memorizzati, organizzati e trasmessi\n\nAree principali:\n- Programmazione e algoritmi  \n- Architettura dei calcolatori  \n- Sistemi operativi  \n- Basi di dati  \n- Reti informatiche  \n- Sicurezza informatica  \n\n## Dato e informazione\n- **Dato**: elemento grezzo (numero, parola, misura) senza contesto  \n- **Informazione**: dato interpretato e reso significativo\n\n## Bit e byte\n- **Bit (b)**: unità minima di informazione (0 o 1)  \n- **Byte (B)**: 8 bit  \n\nMultipli:\n- 1 KB ≈ 1 024 B  \n- 1 MB ≈ 1 024 KB  \n- 1 GB ≈ 1 024 MB  \n- 1 TB ≈ 1 024 GB  \n\n## Algoritmi\nUn **algoritmo** è una sequenza finita di istruzioni non ambigue che, a partire da un input, produce un output.\n\nCaratteristiche:\n- Finitezza  \n- Non ambiguità  \n- Presenza di input e output  \n- Ogni passo eseguibile in tempo finito  \n\n## Pensiero computazionale e coding unplugged\nIl **pensiero computazionale** è la capacità di:\n1. Analizzare un problema (astrazione)  \n2. Progettare una soluzione (algoritmi, automazione)  \n3. Valutare il risultato (correttezza, efficienza)\n\n**Coding unplugged**: attività senza computer per sviluppare logica e problem solving (schemi, giochi, carte, istruzioni passo-passo).",
          "objectives": [],
          "materials": [],
          "exercises": [],
          "lesson_date": "2025-11-26",
          "created_at": "2025-11-17T17:06:04.052255",
          "updated_at": "2025-11-18T16:54:53.794815",
          "modification_count": 0
        },
        {
          "id": 15,
          "title": "Hardware, architettura del computer e memoria",
          "description": "",
          "lesson_type": "theory",
          "duration_hours": 2.0,
          "order": 4,
          "content": "## Cos’è un computer\nUn computer è una macchina programmabile che:\n- riceve dati (input)  \n- li elabora secondo istruzioni (software)  \n- restituisce risultati (output)\n\n## Hardware e software\n- **Hardware**: componenti fisici (CPU, RAM, disco, scheda madre, periferiche…)  \n- **Software**: programmi e sistemi operativi che comandano l’hardware  \n\nEsempi di software:\n- Sistema operativo: Windows, macOS, Linux  \n- Programmi applicativi: elaboratore testi, fogli di calcolo, browser, email  \n\n## Architettura di Von Neumann\nStruttura logica dei computer moderni:\n- **CPU** (unità centrale di elaborazione)  \n- **Memoria centrale**  \n- **Dispositivi di input/output (I/O)**  \n- **Bus** di comunicazione  \n- **Unità di controllo**\n\n## Componenti principali del PC\n- Scheda madre  \n- CPU  \n- RAM  \n- Unità di archiviazione (HDD/SSD)  \n- Scheda video  \n- Alimentatore  \n- Case  \n\n## HDD vs SSD\n**HDD**:\n- Dischi magnetici rotanti  \n- Più economici a parità di spazio  \n- Più lenti e più fragili\n\n**SSD**:\n- Memoria flash  \n- Molto più veloci  \n- Silenziosi, consumano meno  \n- Più costosi a parità di GB\n\nUso tipico: SSD per sistema e programmi, HDD per archiviazione dati.\n\n## RAM: tipi e formati\n- **SRAM**: veloce e costosa, usata come cache  \n- **DRAM**: meno costosa, usata come RAM principale  \n\nGenerazioni: DDR3, DDR4, DDR5.  \nFormati:\n- DIMM per desktop  \n- SODIMM per notebook",
          "objectives": [],
          "materials": [],
          "exercises": [],
          "lesson_date": "2025-11-29",
          "created_at": "2025-11-17T17:06:04.052258",
          "updated_at": "2025-11-18T16:54:53.796828",
          "modification_count": 0
        },
        {
          "id": 16,
          "title": "Sistema operativo e gestione dei file",
          "description": "Descrizione test ",
          "lesson_type": "theory",
          "duration_hours": 2.0,
          "order": 5,
          "content": "## Cos’è un sistema operativo\nIl **sistema operativo (SO)** è il software di base che:\n- gestisce l’hardware (CPU, RAM, periferiche)  \n- organizza file e cartelle  \n- permette l’esecuzione dei programmi  \n- offre un’interfaccia all’utente (grafica o testuale)\n\nEsempi: Windows, macOS, Linux.\n\n## File e cartelle\n- **File**: insieme di dati salvato con un nome e un’estensione (es. `.docx`, `.xlsx`, `.pdf`)  \n- **Cartella**: contenitore di file e altre cartelle  \n\nOperazioni di base:\n- creare, rinominare, copiare, spostare, cancellare  \n- organizzare documenti in modo logico (per materia, progetto, data…)\n\n## Estensioni dei file\nL’estensione indica il tipo di file:\n- `.docx` → documento di testo  \n- `.xlsx` → foglio di calcolo  \n- `.pptx` → presentazione  \n- `.pdf` → documento portabile  \n- `.jpg`, `.png` → immagini  \n\n## Competenze operative di base\n- usare desktop, icone, menù, barra delle applicazioni  \n- gestire pendrive / dischi esterni  \n- usare correttamente salvataggio e “salva con nome”  \n- fare backup periodici dei dati importanti",
          "objectives": [],
          "materials": [],
          "exercises": [],
          "lesson_date": null,
          "created_at": "2025-11-17T17:06:04.052258",
          "updated_at": "2025-11-18T16:54:53.797668",
          "modification_count": 1
        },
        {
          "id": 17,
          "title": "Elaborazione testi (Word o equivalenti)",
          "description": "elaborazione testi in word",
          "lesson_type": "theory",
          "duration_hours": 2.0,
          "order": 2,
          "content": "```markdown\n# Lezione: Elaborazione Testi (Word o Equivalenti)\n\n## Introduzione al Word Processor\n\nUn **elaboratore di testi** è uno strumento essenziale per la creazione e gestione di documenti digitali. Le sue principali funzionalità includono:\n\n- **Creazione di documenti**: redazione di testi, lettere, relazioni e molto altro.\n- **Formattazione di testo e paragrafi**: personalizzazione dell'aspetto del testo per migliorare la leggibilità e l'estetica.\n- **Inserimento di elementi multimediali**: aggiunta di immagini, tabelle ed elenchi per arricchire il contenuto.\n- **Impaginazione e stampa**: organizzazione del layout per la stampa o l'esportazione in diversi formati, come PDF.\n\n## Funzioni Principali di Formattazione\n\n### Formattazione Carattere\n- **Grassetto**: evidenziazione del testo importante.\n- **Corsivo**: utilizzo per citazioni o termini stranieri.\n- **Sottolineato**: enfasi o distinzione di parti del testo.\n- **Colore del testo**: differenziazione visiva per categorie o sezioni.\n\n### Formattazione Paragrafo\n- **Allineamento**: sinistra, destra, centrato o giustificato per un aspetto professionale.\n- **Rientri**: creazione di spaziature per paragrafi o citazioni.\n- **Spaziatura**: impostazione di interlinea e margini per la leggibilità.\n- **Elenchi puntati o numerati**: organizzazione di informazioni in liste ordinate o non.\n\n### Uso degli Stili\n- **Titolo 1, Titolo 2, Corpo del testo**: applicazione di stili predefiniti per mantenere la coerenza nel documento.\n\n## Struttura di un Documento\n\n- **Titolo**: introduzione chiara del contenuto principale.\n- **Sottotitoli / Sezioni**: divisione del testo in parti logiche per una navigazione semplice.\n- **Testo Principale**: sviluppo dettagliato delle informazioni.\n- **Immagini / Tabelle**: supporto visivo per i dati.\n- **Intestazione e Piè di Pagina**: inserimento della data, numero di pagina e nome del documento per una facile referenza.\n\n## Scorciatoie da Tastiera Utili (Win)\n\n- **CTRL + C**: copia\n- **CTRL + V**: incolla\n- **CTRL + X**: taglia\n- **CTRL + Z**: annulla\n- **CTRL + S**: salva\n\n## Esempio Pratico: Creazione di un Documento Base\n\n1. Aprire un nuovo documento nel word processor.\n2. Inserire un **titolo** utilizzando lo stile \"Titolo 1\".\n3. Scrivere un **paragrafo introduttivo** e formattarlo con grassetto e corsivo dove necessario.\n4. Inserire un'**immagine** e una **tabella** per illustrare i punti chiave.\n5. Aggiungere **intestazione e piè di pagina** con la data e il numero di pagina.\n\n## Esportazione in PDF\n\nPer salvare il documento in formato PDF, seguire questi passaggi:\n\n1. Aprire il menù \"File\".\n2. Selezionare \"Esporta\" o \"Salva con nome\".\n3. Scegliere il formato `.pdf` e confermare.\n\nQuesti strumenti e tecniche formeranno la base per la creazione di documenti professionali e ben strutturati.\n```",
          "objectives": [],
          "materials": [
            "\"Microsoft Word 2019 Step by Step\" di Joan Lambert, un libro che offre una guida completa e dettagliata sull'uso di Word per utenti di tutti i livelli.",
            "Articolo online \"Basic Formatting Techniques in Microsoft Word\" disponibile sul sito ufficiale di Microsoft Office Support, utile per comprendere le tecniche di base di formattazione.",
            "Video YouTube \"Microsoft Word - Beginners Tutorial\" sul canale \"Technology for Teachers and Students\", che spiega le funzionalità essenziali di Word in modo chiaro e visivo.",
            "Strumento online gratuito \"Google Docs\", accessibile tramite un account Google, offre funzionalità di elaborazione testi simili a Word e consente la collaborazione in tempo reale.",
            "Software \"LibreOffice Writer\", parte della suite LibreOffice, rappresenta un'alternativa gratuita e open-source a Microsoft Word, disponibile per il download su https://www.libreoffice.org.",
            "Corso online \"Word Essential Training\" su LinkedIn Learning, che fornisce una panoramica completa delle funzionalità principali di Word per principianti e utenti intermedi."
          ],
          "exercises": [
            "Creare un documento di una pagina con un'intestazione personalizzata, un titolo formattato, un paragrafo di testo giustificato e un piè di pagina numerato.",
            "Formattare un elenco puntato con almeno cinque elementi, utilizzando stili differenti per il testo e modificando il simbolo del punto elenco.",
            "Inserire un'immagine nel documento, ridimensionarla e aggiungere un testo alternativo descrittivo; quindi, applicare un layout di testo per spostare l'immagine a destra del paragrafo.",
            "Creare una tabella di tre colonne e quattro righe, inserire dati fittizi e applicare uno stile di tabella per migliorare l'aspetto visivo.",
            "Utilizzare la funzione di revisione per inserire commenti su un paragrafo dato, quindi accettare o rifiutare le modifiche suggerite da un collega."
          ],
          "lesson_date": null,
          "created_at": "2025-11-17T17:06:04.052258",
          "updated_at": "2025-11-18T16:59:13.953911",
          "modification_count": 1
        },
        {
          "id": 18,
          "title": "Fogli di calcolo (Excel o equivalenti)",
          "description": "",
          "lesson_type": "theory",
          "duration_hours": 2.0,
          "order": 6,
          "content": "## Cos’è un foglio di calcolo\nUn foglio di calcolo permette di:\n- organizzare dati in tabelle  \n- eseguire calcoli automatici  \n- creare grafici e riepiloghi  \n\n## Struttura\n- Celle (intersezione di riga e colonna)  \n- Righe (1, 2, 3, …)  \n- Colonne (A, B, C, …)  \n- Fogli multipli nello stesso file\n\n## Formule e operatori\nLe formule iniziano con `=`.\n\nOperatori:\n- `+` addizione  \n- `-` sottrazione  \n- `*` moltiplicazione  \n- `/` divisione  \n\nEsempi:\n- `=A1+B1`  \n- `=(A1+A2)/2`\n\n## Funzioni di base\n- `=SOMMA(A1:A5)`  \n- `=MEDIA(B1:B10)`  \n- `=MIN(C1:C10)`  \n- `=MASSIMO(C1:C10)`  \n- `=CONTA(A1:A100)`  \n\nEsempi leggermente più avanzati:\n- `=ARROTONDA(3,14159; 2)` → 3,14  \n- `=POTENZA(2; 3)` → 8  \n\n## Tabelle e grafici\n- Ordinare i dati per colonna  \n- Applicare filtri  \n- Creare grafici (colonne, linee, torta) a partire da una selezione di celle",
          "objectives": [],
          "materials": [],
          "exercises": [],
          "lesson_date": null,
          "created_at": "2025-11-17T17:06:04.052259",
          "updated_at": "2025-11-18T16:54:45.582290",
          "modification_count": 0
        },
        {
          "id": 19,
          "title": "Browser, motori di ricerca e posta elettronica",
          "description": "",
          "lesson_type": "theory",
          "duration_hours": 2.0,
          "order": 7,
          "content": "## Browser web\nUn **browser** è un programma per navigare in Internet.\n\nFunzioni principali:\n- inserire URL nella barra degli indirizzi  \n- aprire più schede  \n- usare preferiti/segna-pagine  \n- consultare cronologia  \n- scaricare file\n\n## Motori di ricerca\nUn **motore di ricerca** permette di trovare informazioni usando parole chiave.\n\nEsempi:\n- Google  \n- Bing  \n- DuckDuckGo  \n- Ecosia  \n\nConcetti base:\n- usare parole chiave significative  \n- aggiungere parole per restringere la ricerca  \n- tra virgolette per cercare una frase esatta  \n\n## Navigazione in incognito\nLa modalità in incognito:\n- non salva cronologia, cookie e moduli sul dispositivo  \n- non rende invisibili al fornitore di connessione o ai siti web\n\n## Posta elettronica\nCon un account email è possibile:\n- inviare e ricevere messaggi  \n- allegare file  \n- organizzare le email in cartelle / etichette  \n\nElementi di una email:\n- Destinatario  \n- Oggetto  \n- Corpo del messaggio  \n- Allegati  \n\nBuone pratiche:\n- oggetto chiaro e sintetico  \n- stile educato e professionale  \n- attenzione a mittenti sospetti e link strani",
          "objectives": [
            "Comprendere le differenze tra i principali browser web e le loro funzionalità di base",
            "Identificare le caratteristiche chiave dei motori di ricerca e descrivere come funzionano",
            "Spiegare il processo di creazione e gestione di un account di posta elettronica",
            "Descrivere le misure di sicurezza da adottare durante la navigazione web e l'uso della posta elettronica",
            "Analizzare le modalità di utilizzo efficiente dei motori di ricerca per ottenere risultati pertinenti"
          ],
          "materials": [],
          "exercises": [],
          "lesson_date": null,
          "created_at": "2025-11-17T17:06:04.052259",
          "updated_at": "2025-11-19T09:58:59.060629",
          "modification_count": 1
        },
        {
          "id": 20,
          "title": "Reti, Internet e servizi online",
          "description": "",
          "lesson_type": "theory",
          "duration_hours": 2.0,
          "order": 8,
          "content": "## Cos’è una rete\nUna rete informatica è un insieme di dispositivi collegati che possono:\n- scambiarsi dati  \n- condividere risorse (file, stampanti, connessione Internet)\n\n## LAN e WAN\n- **LAN (Local Area Network)**: rete locale (casa, ufficio, scuola)  \n- **WAN (Wide Area Network)**: rete geografica estesa; collega più LAN\n\nInternet è la più grande WAN esistente.\n\n## Tipi di collegamento\n- Cablato (Ethernet)  \n- Wireless (Wi-Fi)  \n- Reti mobili (4G, 5G, ecc.)\n\n## Internet e servizi principali\nInternet permette:\n- navigazione web  \n- email  \n- servizi cloud  \n- social network  \n- chat e videoconferenze  \n- streaming audio/video  \n\n## Protocolli\nLa comunicazione su Internet usa protocolli come:\n- TCP/IP  \n- HTTP/HTTPS per il web  \n- SMTP/IMAP/POP3 per la posta elettronica",
          "objectives": [],
          "materials": [],
          "exercises": [],
          "lesson_date": null,
          "created_at": "2025-11-17T17:06:04.052259",
          "updated_at": "2025-11-18T16:54:45.583166",
          "modification_count": 0
        },
        {
          "id": 21,
          "title": "Database, query e tabelle pivot",
          "description": "",
          "lesson_type": "theory",
          "duration_hours": 2.0,
          "order": 9,
          "content": "## Cos’è un database\nUn **database** è un sistema organizzato per archiviare, gestire e recuperare dati.\n\nCaratteristiche:\n- dati strutturati in tabelle (righe = record, colonne = campi)  \n- gestione tramite un **DBMS** (Database Management System)  \n\nEsempi di utilizzo:\n- anagrafiche clienti  \n- magazzino / prodotti  \n- fatturazione  \n- siti web dinamici\n\n## Database relazionali\nNei database relazionali:\n- i dati sono organizzati in tabelle collegate  \n- si usano chiavi primarie e chiavi esterne per le relazioni  \n- si usa il linguaggio SQL per gestire i dati\n\n## Query\nUna **query** è una richiesta al database:\n- per leggere dati (selezione, filtri, ordinamenti)  \n- per inserire nuovi dati  \n- per modificare o cancellare dati  \n\n## Tabelle pivot\nLe **tabelle pivot** (soprattutto in Excel o DB + strumenti di analisi) servono per:\n- riepilogare grandi quantità di dati  \n- raggruppare per categorie (es. per mese, per città, per prodotto)  \n- calcolare somme, medie, conteggi  \n- creare report e grafici di sintesi",
          "objectives": [],
          "materials": [],
          "exercises": [],
          "lesson_date": null,
          "created_at": "2025-11-17T17:06:04.052260",
          "updated_at": "2025-11-18T16:54:45.583469",
          "modification_count": 0
        },
        {
          "id": 22,
          "title": "Sicurezza informatica e competenze digitali per lavoro/studio",
          "description": "",
          "lesson_type": "theory",
          "duration_hours": 2.0,
          "order": 10,
          "content": "## Principi base della sicurezza\nTre concetti fondamentali:\n- **Confidenzialità**: i dati sono accessibili solo a chi è autorizzato  \n- **Integrità**: i dati non vengono alterati in modo non autorizzato  \n- **Disponibilità**: i dati sono disponibili quando servono\n\n## Malware\nIl **malware** è software dannoso progettato per:\n- danneggiare sistemi  \n- rubare o bloccare dati  \n- controllare il dispositivo\n\nTipi principali:\n- Virus  \n- Worm  \n- Trojan  \n- Spyware  \n- Adware  \n- Ransomware  \n\n## Comportamenti sicuri\n- usare password robuste e diverse per i servizi importanti  \n- non condividere password  \n- non aprire allegati o link sospetti  \n- aggiornare regolarmente sistema operativo e programmi  \n- usare antivirus/antimalware aggiornato  \n- eseguire backup periodici dei dati importanti  \n\n## Competenze digitali per studio e lavoro\nCompetenze essenziali:\n- uso consapevole di computer e dispositivi mobili  \n- gestione ordinata di file e cartelle  \n- utilizzo di Word, Excel e strumenti simili  \n- scrittura di email chiare e professionali  \n- partecipazione a riunioni online  \n- collaborazione su documenti condivisi in cloud  \n- consapevolezza dei rischi della rete e delle regole per proteggersi  \n\n\n# Obiettivi (uno per riga)\n\nSviluppare capacità di analisi e problem solving attraverso il pensiero computazionale  \nComprendere la differenza tra dato, informazione, bit e byte  \nRiconoscere le principali componenti hardware di un computer e il loro ruolo  \nDistinguere tra hardware e software e comprenderne l’interazione  \nComprendere l’architettura di Von Neumann e il flusso delle informazioni nel calcolatore  \nConfrontare HDD e SSD in termini di prestazioni, costo e utilizzo  \nConoscere i principali tipi di RAM e il loro impiego  \nUtilizzare in modo corretto un sistema operativo per la gestione di file e cartelle  \nUtilizzare un word processor per creare e formattare documenti strutturati  \nUtilizzare un foglio di calcolo per eseguire calcoli di base e semplici analisi dati  \nApplicare formule e funzioni elementari in un foglio di calcolo (SOMMA, MEDIA, MIN, MASSIMO, CONTA)  \nCreare e gestire un account di posta elettronica per comunicazioni formali  \nNavigare sul web in modo efficace utilizzando browser e motori di ricerca  \nValutare quando usare motori di ricerca alternativi in base a privacy ed esigenze specifiche  \nComprendere limiti e utilizzo della navigazione in incognito  \nDistinguere tra LAN, WAN e Internet in base ad area coperta e caratteristiche  \nComprendere il ruolo dei protocolli (es. TCP/IP) nella comunicazione in rete  \nDefinire che cos’è un database e a cosa serve in contesti reali  \nComprendere cosa sono i database relazionali e l’uso di tabelle, relazioni e chiavi  \nComprendere il concetto di query e il suo ruolo nell’estrazione dei dati  \nComprendere il ruolo delle tabelle pivot nell’analisi e nel riepilogo dei dati  \nRiconoscere i principali tipi di malware (virus, worm, trojan, spyware, adware, ransomware)  \nComprendere i principi fondamentali della sicurezza informatica (confidenzialità, integrità, disponibilità)  \nAdottare comportamenti di base per proteggere dati, account e dispositivi  \nUtilizzare strumenti digitali di collaborazione e comunicazione per studio e lavoro",
          "objectives": [],
          "materials": [],
          "exercises": [],
          "lesson_date": "2026-01-08",
          "created_at": "2025-11-17T17:06:04.052260",
          "updated_at": "2025-11-18T16:54:45.583864",
          "modification_count": 0
        }
      ]
    },
    {
      "id": 3,
      "code": "Sostenibilità Logistica",
      "name": "Sostenibilità Logistica",
      "description": "Sostenibilità Logistica",
      "total_hours": 30,
      "theory_hours": 30,
      "practice_hours": 0,
      "num_lessons": 5,
      "created_at": "2025-11-19T11:45:08.624319",
      "export_count": 15,
      "lessons": [
        {
          "id": 24,
          "title": "Lezione 1 — Fondamenti di sostenibilità, logistica e Life-Cycle Thinking (3 ore)**",
          "description": "",
          "lesson_type": "theory",
          "duration_hours": 2.0,
          "order": 1,
          "content": "**Lezione 1 Fondamenti di sostenibilità, logistica e Life-Cycle Thinking (3 ore)**\n\nIntroduzione alla sostenibilità nel settore logistico\n\n**1.1 Triple Bottom Line**\n\nEconomico: Analisi dei costi e benefici di pratiche sostenibili.\nSociale: Impatto delle operazioni logistiche sulle comunità locali.\nAmbientale: Riduzione dell'impatto ambientale attraverso pratiche ecologiche.\n\n**1.2 Evoluzione delle normative e pressioni di mercato**\n\nNormative ambientali: Panoramica delle normative chiave che influenzano la logistica.\nPressioni di mercato: Tendenze globali e richieste dei consumatori per una logistica più sostenibile.\n\nLife-Cycle Thinking (LCT)\n\n**2.1 Visione sistemica dei processi**\n\nConcetto di LCT: Comprendere l'importanza di considerare l'intero ciclo di vita dei prodotti.\nEsempi pratici: Caso studio di un prodotto comune, dall'approvvigionamento delle materie prime allo smaltimento.\n\n**2.2 Valutazione degli impatti lungo l’intero ciclo di vita**\n\nMetodologie di valutazione: Strumenti e approcci per misurare gli impatti ambientali.\nApplicazioni nel settore logistico: Come le aziende utilizzano LCT per migliorare l'efficienza e ridurre l'impatto ambientale.\n\nImpronta ecologica e indicatori ambientali di base\n\n**3.1 Definizione e funzionamento**\n\nConcetto di impronta ecologica: Misurare la domanda umana sulle risorse naturali.\nIndicatori ambientali: CO2, consumo di energia, uso dell'acqua.\n\n**3.2 Applicazioni alle attività di trasporto e magazzino**\n\nTrasporto: Strategie per ridurre l'impronta ecologica nei trasporti.\nMagazzino: Tecniche per ottimizzare l'efficienza energetica nei magazzini.\n\nDiscussione guidata\n\n**4.1 Esempi di imprese logistiche che hanno introdotto strategie green**\n\nCase studies: Analisi di aziende leader nel settore che hanno implementato con successo pratiche sostenibili.\n\n**4.2 Brainstorming iniziale: “Dove produce impatto la logistica?”**\n\nAttività di gruppo: Identificare le aree di maggiore impatto ambientale e sociale nella logistica.\nCondivisione delle idee: Discussione aperta per esplorare soluzioni innovative.\n\n",
          "objectives": [
            "Comprendere i concetti base di sostenibilità ambientale applicati alla logistica.",
            "Introdurre il paradigma del *Life-Cycle Thinking*.",
            "Inquadrare l’impatto ecologico delle attività logistiche.",
            "Comprendere i principi fondamentali della sostenibilità ambientale e il loro impatto sulla logistica",
            "Identificare le principali fasi del ciclo di vita di un prodotto e il loro significato nel contesto del Life-Cycle Thinking",
            "Analizzare l'importanza del Life-Cycle Thinking nella riduzione dell'impatto ambientale delle operazioni logistiche",
            "Esaminare le interazioni tra sostenibilità, logistica e ciclo di vita per migliorare l'efficienza dei processi aziendali"
          ],
          "materials": [
            "Libro: \"Cradle to Cradle: Remaking the Way We Make Things\" di William McDonough e Michael Braungart",
            "Articolo: \"The Triple Bottom Line: What Is It and How Does It Work?\" di Andrew Savitz su Harvard Business Review",
            "Video YouTube: \"Life Cycle Assessment (LCA) Explained\" di Thinkstep (canale: Sphera)",
            "Software: OpenLCA - strumento open-source per l'analisi del ciclo di vita",
            "Risorsa online: Sito web dell'ISO 14001 - informazioni sulle normative ambientali e sugli standard per la gestione ambientale",
            "Articolo: \"Sustainable Logistics and Supply Chain Management\" di David B. Grant, pubblicato su Logistics & Transport Focus"
          ],
          "exercises": [
            "Analizza un caso studio reale di un'azienda logistica che ha implementato pratiche sostenibili e discuti i benefici economici, sociali e ambientali ottenuti.",
            "Simula una riunione di un team logistico per identificare le principali normative ambientali che influenzano le operazioni e proponi strategie per rispettarle.",
            "Crea una mappa mentale che collega i concetti di Triple Bottom Line con esempi pratici nel settore logistico.",
            "Sviluppa una breve presentazione in cui descrivi come il Life-Cycle Thinking può essere applicato per ridurre l'impatto ambientale in una catena di approvvigionamento.",
            "Conduci un'analisi SWOT per un'azienda logistica, concentrandoti sulle opportunità e minacce legate alla sostenibilità e alle normative ambientali."
          ],
          "lesson_date": "2025-11-25",
          "created_at": "2025-11-19T11:45:08.631295",
          "updated_at": "2025-11-19T12:43:27.916294",
          "modification_count": 9
        },
        {
          "id": 25,
          "title": "Lezione 2 — Life Cycle Assessment (LCA) e analisi dell’impatto nei processi logistici (3 ore)**",
          "description": "",
          "lesson_type": "theory",
          "duration_hours": 2.5,
          "order": 2,
          "content": "1. Metodologia LCA (ISO 14040 e 14044)\n\nDefinizione degli obiettivi e campo di applicazione\nInventario (LCI)\nValutazione degli impatti (LCIA)\nInterpretazione dei risultati\n\n2. Applicazioni LCA nella logistica\n\nPackaging\nMovimentazione merci\nTrasporto multimodale\n\n3. Strumenti di simulazione\n\nEco-indicator\nSoftware LCA: panoramica (SimaPro, OpenLCA, GaBi)\n\n4. Laboratorio / esercitazione\n\nMini-LCA su un processo logistico (es. trasporto pallet)\n",
          "objectives": [
            "Apprendere le fasi metodologiche del Life Cycle Assessment.",
            "Applicare LCA a prodotti e processi logistici.",
            "Comprendere come misurare e interpretare gli impatti."
          ],
          "materials": [],
          "exercises": [],
          "lesson_date": "2025-11-26",
          "created_at": "2025-11-19T11:45:08.631297",
          "updated_at": "2025-11-19T12:47:02.956687",
          "modification_count": 4
        },
        {
          "id": 26,
          "title": "Lezione 3 — Gestione delle risorse, rifiuti post-produzione e principi di green supply chain (3 ore)**",
          "description": "",
          "lesson_type": "theory",
          "duration_hours": 3.0,
          "order": 3,
          "content": "1. Gestione responsabile delle risorse\nOttimizzazione energetica e idrica\nRiduzione degli sprechi nei magazzini\nGestione rifiuti post-produzione\n\n2. Green supply chain management\nDriver della sostenibilità\nStrategie: efficienza, riduzione emissioni, design dei flussi\n\n3. Trasporto sostenibile\nVeicoli a basso impatto\nIntermodalità\nRinnovo flotte\nSistemi di monitoraggio\n\n4. Decarbonizzazione\nAnalisi delle emissioni Scope 1-2-3\nTecniche di mitigazione\n",
          "objectives": [
            "Analizzare la gestione responsabile di energia, materiali e risorse nella logistica.",
            "Conoscere la green supply chain e i modelli di decarbonizzazione.",
            "Studiare strumenti pratici per la riduzione degli sprechi."
          ],
          "materials": [],
          "exercises": [],
          "lesson_date": "2025-12-04",
          "created_at": "2025-11-19T11:45:08.631298",
          "updated_at": "2025-11-19T12:47:10.378596",
          "modification_count": 2
        },
        {
          "id": 27,
          "title": "Lezione 4 — Carbon footprint, ecodesign, qualità e modelli di business sostenibili (3 ore)**",
          "description": "",
          "lesson_type": "theory",
          "duration_hours": 3.0,
          "order": 4,
          "content": "1. Carbon Footprint in magazzino e trasporto\nMetodi di calcolo (GHG Protocol)\nKPI energetici\nStrategie di riduzione nelle infrastrutture portuali, nei magazzini e nei trasporti\n\n2. Ecodesign e progettazione sostenibile\nMateriali a basso impatto\nProgettazione di servizi e processi “low impact”\n\n3. Strumenti di valutazione della sostenibilità\nEco-indicator (analisi pratica)\nQuality Function Deployment (QFD) applicato all’ambiente\n\n4. Modelli di business sostenibili\nCircular business models\nProduct Service Systems (PSS): integrazione prodotto/servizio\nEsempi reali: sharing, leasing, manutenzione predittiva\n",
          "objectives": [
            "Calcolare e ridurre la carbon footprint nelle operazioni logistiche.",
            "Integrare ecodesign e strumenti di valutazione nella progettazione dei processi.",
            "Conoscere modelli di business moderni come i Product Service Systems."
          ],
          "materials": [],
          "exercises": [],
          "lesson_date": "2025-12-10",
          "created_at": "2025-11-19T11:45:08.631299",
          "updated_at": "2025-11-19T12:47:17.721217",
          "modification_count": 3
        },
        {
          "id": 28,
          "title": "Lezione 5 — Reverse logistics, economia circolare e casi studio applicati (3 ore)**",
          "description": "",
          "lesson_type": "theory",
          "duration_hours": 3.0,
          "order": 5,
          "content": "1. Reverse logistics\nFlussi di ritorno: resi, recupero prodotti, ricondizionamento\nGestione dei materiali e packaging di ritorno\n\n2. Economia circolare\nModelli chiave\nRegola delle 4R\nApplicazioni nei processi logistici\n\n3. Casi studio\nMagazzini green\nTrasporto a basse emissioni\nIniziative sostenibili nelle infrastrutture portuali\n\n4. Laboratorio finale\nSviluppo di un mini progetto: “Progetta un flusso logistico sostenibile”\nDiscussione collettiva sui risultati\n",
          "objectives": [
            "Capire il ruolo della reverse logistics nell’economia circolare.",
            "Imparare la regola delle 4R (riduci, riutilizza, ricicla, recupera).",
            "Applicare i concetti studiati a casi reali del settore logistico e portuale."
          ],
          "materials": [],
          "exercises": [],
          "lesson_date": "2025-12-16",
          "created_at": "2025-11-19T11:45:08.631300",
          "updated_at": "2025-11-19T12:47:28.968811",
          "modification_count": 2
        }
      ]
    }
  ],
  "preferences": [
    {
      "key": "defaultLessonDuration",
      "value": "5",
      "updated_at": "2025-11-18T12:50:04.065754"
    },
    {
      "key": "defaultLessonType",
      "value": "theory",
      "updated_at": "2025-11-18T12:50:04.069367"
    },
    {
      "key": "defaultLessonTime",
      "value": "09:00",
      "updated_at": "2025-11-18T12:50:04.069998"
    },
    {
      "key": "exportAuthor",
      "value": "Leonardo Lomartire",
      "updated_at": "2025-11-18T12:50:04.070502"
    },
    {
      "key": "exportCompany",
      "value": "Capera",
      "updated_at": "2025-11-18T12:50:04.070976"
    },
    {
      "key": "includeFooter",
      "value": "true",
      "updated_at": "2025-11-18T12:50:04.073112"
    },
    {
      "key": "aiModel",
      "value": "gpt-4o",
      "updated_at": "2025-11-18T12:50:04.073626"
    },
    {
      "key": "aiTemperature",
      "value": "0.7",
      "updated_at": "2025-11-18T12:50:04.074103"
    },
    {
      "key": "aiMaxTokens",
      "value": "2000",
      "updated_at": "2025-11-18T12:50:04.074491"
    },
    {
      "key": "autoExpandLessons",
      "value": "true",
      "updated_at": "2025-11-18T12:50:04.074955"
    },
    {
      "key": "questionsCount",
      "value": "30",
      "updated_at": "2025-11-18T12:50:04.075348"
    },
    {
      "key": "questionsOptions",
      "value": "4",
      "updated_at": "2025-11-18T12:50:04.075765"
    },
    {
      "key": "slidesPerLesson",
      "value": "10",
      "updated_at": "2025-11-18T12:50:04.076123"
    },
    {
      "key": "includeImages",
      "value": "true",
      "updated_at": "2025-11-18T12:50:04.076460"
    },
    {
      "key": "coursesDir",
      "value": "courses",
      "updated_at": "2025-11-18T12:50:04.076801"
    },
    {
      "key": "mdSourceDir",
      "value": "MD",
      "updated_at": "2025-11-18T12:50:04.077111"
    },
    {
      "key": "enableDebugLogs",
      "value": "false",
      "updated_at": "2025-11-18T12:50:04.077990"
    },
    {
      "key": "hourlyRate",
      "value": "35",
      "updated_at": "2025-11-18T12:50:04.072327"
    }
  ]
}